Revit 2027 API
DuctFittingAndAccessoryData.ServerGUID Property
 The GUID of the duct fitting or duct accessory.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid ServerGUID { get; }
Public ReadOnly Property ServerGUID As Guid
	Get
public:
property Guid ServerGUID {
	Guid get ();
}
member ServerGUID : Guid with get
Property Value
Guid
See Also
Reference
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace